app/views/tags/show.html.erb

SELECT "articles".* FROM "articles" INNER JOIN "taggings" ON "articles"."id" = "taggings"."article_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 7]]
---
<ul id = "articles">
  <% @tag.articles.each do |article| %>