app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "articles" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_updated_at", "2016-08-02 12:25:02.848011"], ["image_file_name", "images.jpeg"], ["updated_at", "2016-08-02 12:25:02.888520"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)