app/controllers/tags_controller.rb

  def destroy
	@tag = Tag.find(params[:id])
	@tag.destroy
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]